[
    "SCENE 1\n\nINT./EXT. VARIOUS KINGDOMS - DAY/NIGHT (MONTAGE)\n\nSHOT 1\nEXT. VARIOUS LANDSCAPES - DAY (ESTABLISHING MONTAGE)\n\nA rapid, sweeping montage of impossible scale: jagged, snow-capped peaks of the EAST. Shimmering heat haze over the arid plains of the SOUTH. Perpetual, cold mists cling to the Western Sea cliffs. The orchestral score swells dramatically, full of foreboding majesty.\n\nSHOT 2\nINT. IRON THRONE HALL - NIGHT\n\nCLOSE UP on the heavy, ornate IRON CROWN resting precariously on KING ALDRIC’s (70s, frail) brow. The hall is vast, lit by hundreds of flickering candles reflecting off polished marble.\n\nAldric attempts to raise a heavy silver goblet. His hand visibly TREMBLES.\n\nSHOT 3\nINT. IRON THRONE HALL - CONTINUOUS\n\nEXTREME CLOSE UP on Aldric’s wide, horrified eyes. He GAGS.\n\nThe goblet slips. SOUND cuts: a sharp, deafening CRACK as the heavy iron cup SMASHES against the marble floor. Servants flinch violently.\n\nVOICEOVER (MALE, DEEP, SOMBER)\nWhen the iron crown falls, the seven will burn.\n\nSHOT 4\nMONTAGE OF RISING POWER - DAY\n\n-- Queen SERA (30s, fierce, armored in black obsidian) stands on a desert precipice, arms outstretched, legions obediently waiting below.\n\n-- PRINCE KAEL (30s, sharp features, intense gaze) is silhouetted against the orange GLOW of countless subterranean forge fires, intensely studying colossal, ancient military maps.\n\n-- Warlord THE WOLF (40s, imposing, scarred face) stands motionless amidst a swirling white BLIZZARD, a monstrous, snarling DIREWOLF resting its muzzle near his shoulder.\n\nSHOT 5\nEXT. VARIOUS BATTLE LINES - DAY\n\nA massive, coordinated SOUND CUE: thousands of boots, hooves, and the groaning of siege engines all hitting tempo.\n\nClose on dozens of BANNERS—the Southern Sun, the Eastern Gryphon, the Northern Ice—unfurling simultaneously against harsh skies, signaling mobilization. The civil war has begun.\n\n\nSCENE 2\n\nEXT. VARIOUS BATTLEFIELDS - DAY\n\nSHOT 1\nEXT. EASTERN MOUNTAIN PASS - DAY\n\nKAEL’s highly disciplined forces operate massive CATAPULTS. The projectiles are arcane, glowing with trapped blue energy, smashing stone fortifications.\n\nKael observes from a high, secure battlement. His expression is utterly devoid of emotion—cold calculation. SOUND of heavy bombardment and sharp, tactical commands.\n\nSHOT 2\nEXT. SOUTHERN PLAINS - DAY\n\nSERA’s massive, heavily armored CAVALRY charge across arid plains. They are a terrifying, cohesive unit, kicking up vast clouds of choking dust.\n\nSera is clearly visible at the very front rank, riding powerfully, her long sword carving a silver arc as she prepares to strike.\n\nSERA (Sharp, projecting over the charge)\nHold the line! For the South!\n\nSHOT 3\nEXT. FROZEN NORTHERN FOREST - DAY\n\nUtter chaos erupts as THE WOLF and his wild NORTHERN WARRIORS burst from the tree line. The DEAFENING HOWL of their accompanying DIREWOLVES dominates the soundscape.\n\nThe Wolf swings a colossal, rustic battle axe, leveraging brute, savage power against the neatly arrayed discipline of the opposing infantry.\n\nSHOT 4\nEXT. NARROW CANYON - DAY\n\nSera’s Southern Infantry are trapped. They are pinned down in the narrow confines of the canyon, visible panic in their eyes. Kael’s archers rain down arrows from above unseen positions.\n\nAbruptly, the ground beneath them begins to SHAKE VIOLENTLY, a deep, unnatural tremor that makes the soldiers lose footing.\n\nSHOT 5\nEXT. BATTLEFIELD EDGE - CONTINUOUS\n\nOn one edge of the fray, a zone of unnatural SILENCE briefly falls.\n\nIn the foreground, covered in centuries of dust, a single IRON SHOVEL scrapes against desiccated earth. A skeletal hand, impossibly ancient and brittle, grips the soil and pulls itself upright. In the far distance, a faint, sickly GREEN LIGHT flickers across the horizon.\n\n\nSCENE 3\n\nEXT. RUINS OF THE FIRST KINGDOM CAPITAL - DAY\n\nSHOT 1\nEXT. RUINS - TENSE STANDOFF\n\nA low-angle shot emphasizes the immense, cyclopean stone blocks of the ruined high city. SERA and THE WOLF stand opposite PRINCE KAEL, their posture wary and hostile.\n\nShadowed figures, robed in deep black, stand behind Kael—the SHADOW WEAVERS. The air between the opposing groups visibly CRACKLES with negative energy.\n\nTHE WOLF (Low growl)\nTreachery costs more than gold, Prince.\n\nSHOT 2\nEXT. RUINS - THE INVASION\n\nA sickening, drawn-out sound effect of grinding tectonic plates. A colossal FISSURE tears open the earth near the ruins—The Shadow Gate. From it, a wave of shambling, skeletal warriors, wielding rusted, ancient weapons, pour forth—the Risen Horde.\n\nThe living armies recoil in unified horror. Kael stands proudly beside the Weavers, now glowing faintly with dark, revitalized energy.\n\nSHOT 3\nEXT. RUINS - FORGED ALLIANCE\n\nSera and The Wolf lock eyes across the chaos—no words exchanged, only a sharp, grim nod of necessity.\n\nThey plunge simultaneously into the surging tide of the undead. The battle becomes a maelstrom of clashing steel against decaying bone. Kael’s human remnants are momentarily forgotten as the true existential threat arrives. Violent, desperate, hand-to-hand combat erupts.\n\nSHOT 4\nEXT. SHADOW FISSURE - CLIMAX\n\nThe Wolf, battered and bleeding, fights a clear path toward the open, swirling green maw of the Shadow Gate. He yells a final, guttural, oath of defiance to his gods, focusing all his inner strength.\n\nHe THROWS himself directly into the churning, green void. An enormous, primal burst of energy erupts outward, and the fissure SNAPS SHUT with the sound of collapsing mountains. Silence, absolute and thick, descends briefly over the ruined field.\n\nSHOT 5\nEXT. RUINS DAIS - DAWN\n\nThe sun breaks weakly over a ravaged continent. The supernatural threat is quelled, but the cost is evident in the carnage.\n\nSera stands alone now on a newly consecrated, clean stone dais carved from the ruins. She slowly lifts a new crown—thinner, simpler, made of bright SILVER—and places it upon her head. Her face betrays profound sorrow, yet her jaw is set with unbreakable resolve.\n\nFADE TO BLACK.\n\nFINAL MUSICAL STING: A single, clear, hopeful note rings out amidst silence."
]