{
    "idx": 7,
    "is_last": false,
    "cam_idx": 7,
    "visual_desc": "SLOW MOTION SEQUENCE. The massive throne room doors, made of dark, thick wood banded with iron, burst inward violently, sending splinters flying across the wide perspective. <MORGATH> enters the frame from the center, perfectly composed. Her fitted black gown flows dramatically, and her long, straight raven hair streams behind her as if she’s underwater. The lighting is cold, blue-grey moonlight mixing with dying torch fire, creating very sharp contrast. She walks with unnerving, predatory grace past the shapes of fallen guards, utterly untouched by the carnage. The camera position is LOW-ANGLE, looking up at her, emphasizing her height and imposing silhouette against the background of destruction. She stops near the ornate, gilded crib positioned slightly to the right. <MORGATH> (silky, soft, almost musical) says: \"Shhh. Shhh. Your father's crown is mine now, little prince. But you... you I will keep.\"",
    "variation_type": "large",
    "variation_reason": "This is an exaggerated transition shot where the entire composition violently changes from an empty doorway to a focused, low-angle confrontation involving explosive entry and immediate confrontation with a central figure and a key prop (the crib). The shot moves from wide perspective to a focused mid-to-close presentation of the figure and the infant.",
    "ff_desc": "A photorealistic medieval fantasy wide shot, shot on Arri Alexa 65 with Panavision anamorphic lenses, capturing the massive throne room doors of dark, thick wood banded with iron, currently intact. The scene is dominated by cold, blue-grey moonlight mixing with the light of dying torch fire, creating very sharp chiaroscuro contrast. The low-angle perspective is established, looking toward the closed doorway which dominates the central background. No figures are visible yet near the door or in the foreground.",
    "ff_vis_char_idxs": [],
    "lf_desc": "A photorealistic medieval fantasy low-angle close-up on an ornate, gilded infant crib positioned slightly to the right. The structure of the crib shows rich, tactile detail. The blue-grey light from the moonlight contrasts sharply with the few remaining dying torch embers, casting deep shadows. The figure in the fitted black gown, with long straight raven-black hair, stands motionless immediately adjacent to the crib, looking down. The figure's porcelain-pale skin and crimson lips are visible, illuminated sharply by the cold light. The swaddled infant prince lies still inside the crib.",
    "lf_vis_char_idxs": [
        2
    ],
    "motion_desc": "In slow motion, the massive throne room doors violently burst inward from the center, sending splinters of dark wood flying across the frame. Simultaneously, the figure in the fitted black gown enters the frame from the center, moving with unnerving, predatory grace past the shapes of fallen guards lying in the periphery of the shot. The low-angle camera remains static, emphasizing the imposing silhouette of the figure against the destructive background. The flowing black gown and the streaming raven hair suggest underwater movement. The figure stops near the ornate, gilded crib located to the right. As she stops, the figure speaks in a silky, soft, almost musical voice: \"Shhh. Shhh. Your father's crown is mine now, little prince. But you... you I will keep.\" The ambient sound is dominated by the sharp crackling of dying torch fire, overlaid with a low, melancholic score featuring only a single high violin note.",
    "audio_desc": "[Sound Effect] Massive sound of wood splintering and tearing. All chaotic background sound is suppressed by the score transition. [Score] The dark, seductive cello motif plays its signature riff, cutting sharply through any other ambient noise."
}