{
    "idx": 2,
    "is_last": false,
    "cam_idx": 2,
    "visual_desc": "CLOSE UP - <Morgath> and BOOK. The camera executes a slow, deliberate DOLLY toward her, focusing through shallow depth of field on the ancient, enormous leather-bound book resting on a heavy stone pedestal. The pages are thick and yellowed, covered in arcane script that emits a sickly, internal green luminescence. The light catches the high sharpness of <Morgath>'s cheekbones and reflects unnervingly in her dark, large eyes, which are focused intently on the text. Her gloved hands rest lightly on the edges of the pages. The texture of the aged parchment and pitted iron of the pedestal are highly detailed.",
    "variation_type": "small",
    "variation_reason": "This shot primarily involves a camera movement (dolly in) and character focus, but the internal state and posture of the character remain essentially unchanged, resulting in only minor alterations to the composition's scale and emphasis.",
    "ff_desc": "A photorealistic medieval fantasy CLOSE UP, shot with an Arri Alexa 65 and Panavision anamorphic lenses, featuring Morgath and an ancient, enormous leather-bound book resting on a heavy stone pedestal. The book's thick, yellowed pages display arcane script emitting a sickly, internal green luminescence. The lighting sculpts the sharp planes of Morgath's face, catching the high sharpness of her cheekbones. Her large, dark, unreadable eyes are focused intently on the text, showing no warmth but severe concentration. She wears long black gloves, her hands resting lightly on the edges of the parchment. The composition emphasizes the tactile texture of the aged parchment and the pitted iron of the pedestal. The scene is dominated by rich dark crimson-and-black tones.",
    "ff_vis_char_idxs": [
        2
    ],
    "lf_desc": "A photorealistic medieval fantasy CLOSE UP, shot with an Arri Alexa 65 and Panavision anamorphic lenses, focused on the ancient, enormous leather-bound book resting on a heavy stone pedestal. The book's thick, yellowed pages covered in arcane script still emit a sickly, internal green luminescence. The light catches the high sharpness of Morgath's cheekbones and reflects in her large, dark, unreadable eyes, which remain intensely fixed upon the text. Her gloved hands are positioned identically to the start of the shot, holding the edges of the pages steady. The texture of the aged parchment and pitted iron remains highly detailed. The scene maintains rich dark crimson-and-black tones.",
    "lf_vis_char_idxs": [
        2
    ],
    "motion_desc": "The camera executes a slow, deliberate DOLLY toward the figure wearing the fitted black gown and long black gloves, maintaining a tight frame to keep both the figure and the book prominently featured in the shallow depth of field. The movement slows slightly as the camera nears its end point. During the shot, the figure wearing the black gown remains almost entirely static, her posture unchanged, her gaze locked onto the glowing text of the book. The only change is the subtle, almost imperceptible shift in shadow and highlight across her face as the camera moves closer, emphasizing the unsettling quality of her beauty and the green glow illuminating the lower half of her face from the manuscript. Ambient sound is dominated by a low cello drone under the faint ambient sound of silence.",
    "audio_desc": "[Speaker] Morgath (silky, soft, almost musical, each word savored): \"The thousand-year moon. It rises when he turns eighteen. One ritual. One sacrifice. Royal blood, freely given or taken by force. And I will have power that no mortal has held since the world was young.\" [Sound Effect] A low, mechanical HUM emanates distinctly from the glowing book, pulsing slightly with her words."
}