{
    "idx": 2,
    "is_last": false,
    "cam_idx": 2,
    "visual_desc": "WIDE SHOT of the THRONE ROOM — NIGHT. The lighting is thrown into sudden chaos, flickering shadows mixing with the warm residual light of the feast, now tainted by urgency. Shadowy ASSASSINS, dressed in deep black practical garb, surge from the corners and recesses of the frame. Furniture lies overturned in the foreground, their wood texture rough and damaged. TAPESTRIES are violently slashed mid-frame. <KING EDRAN> (weathered face, armor catching the chaotic light) leaps up from the throne on the left side of the frame, drawing his heavy sword with practiced speed. He is facing center-right where the assassins are densest.  <KING EDRAN> (roaring above the din) says: \"To arms! Protect the Queen!\" The shot is handheld, vibrating slightly to convey kinetic violence.",
    "variation_type": "medium",
    "variation_reason": "The frame changes significantly due to major action: the main character rising and drawing a weapon, and the entry of multiple antagonists into the primary action space, which necessitates a significant shift in composition and focus despite the camera remaining in the same general position (though handheld). New, immediate threats are established.",
    "ff_desc": "A photorealistic medieval fantasy wide shot, shot on Arri Alexa 65 with Panavision anamorphic lenses, capturing the THRONE ROOM at night. The composition is thrown into chaos, with overturned furniture having a rough, damaged wood texture dominating the foreground. The lighting is flickering, a mix of residual warm feast light tainted by urgent, chaotic shadows. Several shadowy figures in deep black practical garb are visible, surging from surrounding corners and recesses. Several large tapestries in the mid-frame show violent slashes. In the left half of the frame, the figure identifiable as KING EDRAN (weathered face, wearing practical armor that catches the chaotic light) is rising abruptly from the throne, his body tense, currently in the act of drawing a heavy sword, facing toward the center-right where the surge of assailants is most concentrated. The shot exhibits a slight handheld vibration.",
    "ff_vis_char_idxs": [
        0
    ],
    "lf_desc": "A photorealistic medieval fantasy wide shot, shot on Arri Alexa 65 with Panavision anamorphic lenses, capturing the THRONE ROOM at night. The chaotic aftermath of the initial surge is evident: overturned furniture remains on the floor, and large tapestries showing violent slashes are still visible in the mid-frame. The lighting remains highly contrasted, creating deep chiaroscuro shadows. The figure identifiable as KING EDRAN (weathered face, practical armor) is now fully standing, positioned centrally and slightly to the left of the frame, his heavy sword fully drawn and held defensively outward toward the right. His stance is aggressive, jaw visibly set, chest heaving slightly from exertion. Several shadowy figures in deep black practical garb are now positioned closer to the center and right, surrounding the King defensively. The handheld camera vibration has ceased.",
    "lf_vis_char_idxs": [
        0
    ],
    "motion_desc": "The shot begins handheld, vibrating slightly to convey kinetic violence. Immediately, several shadowy figures dressed in deep black practical garb surge forward from the periphery (corners and recesses) into the center of the frame. Simultaneously, the figure identifiable as KING EDRAN (weathered face, wearing practical armor) leaps up from the throne on the left side of the frame, performing a rapid, practiced draw of his heavy sword, positioning himself to face the densest concentration of the attackers toward the center-right. As this happens, the figure identifiable as KING EDRAN (weathered face, wearing practical armor, armored) roars above the din ('To arms! Protect the Queen!'). The camera movement is a continuous, non-smooth, handheld shake that persists throughout the action, emphasizing the frantic, violent activity within the throne room, before settling slightly at the conclusion, though the grain texture of 35mm film remains evident.",
    "audio_desc": "[Sound Effect] A sudden eruption of screams, the sickening clang of steel meeting steel, and the heavy crash of overturned furniture. [Score] A sudden, jarring orchestral stab, quickly dissolving into chaotic percussion."
}