{
    "idx": 6,
    "is_last": false,
    "cam_idx": 6,
    "visual_desc": "A dynamic, wide shot capturing the center of the chamber. The ornate MIRROR EXPLODES outward. We see <Morgath> momentarily struck by the force, her arms raised defensively, dark glass shards (rendered sharp and realistic) flying directly toward the camera lens and across the frame. The camera locks onto <Morgath's> furious, startled face caught amidst the immediate debris—a micro-expression of rage mixed with surprise. Warm, deep shadows are violently interrupted by sharp, bright reflections off the thousands of razor-sharp shards of dark glass tumbling through the air. This shot uses shallow depth of field to create anamorphic bokeh flares from the scattering reflections.",
    "variation_type": "large",
    "variation_reason": "The shot is a dramatic and violent transition from a static wide environmental framing centered on an object (the mirror) to an extreme close-up focused entirely on a character's face amidst an explosion of debris. The change in framing, action, and focus is massive, warranting a 'large' variation type.",
    "ff_desc": "A photorealistic medieval fantasy wide shot capturing the center of a chamber, utilizing deep chiaroscuro shadows and shallow depth of field with creamy anamorphic bokeh. The composition is dominated by an ornate MIRROR set against a dark wall. The lighting is dramatic, featuring warm, deep shadows heavily implying an interior space associated with the character in black. The mirror's surface is reflective. No characters are initially visible in sharp focus, only the environment before the violent action initiates.",
    "ff_vis_char_idxs": [],
    "lf_desc": "A photorealistic medieval fantasy close-up shot, shot on Arri Alexa 65 with Panavision anamorphic lenses, capturing the face of a woman who appears early 40s—porcelain-pale skin with natural texture, high sharp cheekbones, and large dark nearly-black eyes—now smeared with fine, dark glass dust. Her full crimson lips are slightly parted in an expression of enraged astonishment. Intense, sharp, bright reflections momentarily flash across her face, illuminated by the scattered shards. Shallow depth of field keeps her face sharp while the immediate foreground and background melt into intense, specular anamorphic bokeh flares from thousands of razor-sharp dark glass fragments tumbling in the air just inches from the lens.",
    "lf_vis_char_idxs": [
        2
    ],
    "motion_desc": "The static camera remains locked in place (static shot) as the ornate MIRROR explodes outward in a violent, immediate action. Simultaneously, the woman wearing the fitted black gown with a high structured collar is struck by the force: her arms fly up defensively toward her face. Thousands of dark glass shards fly directly toward the camera lens, creating a momentary visual curtain of debris. The camera then cuts/pushes in rapidly onto the uncovered face of the woman in black, who is caught amidst the immediate flying debris, her expression transitioning from startled reaction to pure rage. The lighting shifts violently, with the warm, deep shadows being sharply interrupted by brilliant flashes of light reflecting off the razor-sharp shards tumbling through the air, creating strong anamorphic bokeh flares near the lens.",
    "audio_desc": "[Sound Effect] A massive, violent, deafening CRASH of shattering glass, echoing in the stone chamber. [Score Cue] The chaos is punctuated by a single, long, ominous, vibrating BASS NOTE that decays immediately into absolute dead silence."
}