{
    "idx": 1,
    "is_last": false,
    "cam_idx": 1,
    "visual_desc": "FADE IN to UNDER CASTLE TUNNELS - NIGHT. A tight tracking shot follows <Queen Lyara>, <Sir Aldren>, and the infant <Elara (Infant)>. The environment is claustrophobic, illuminated by the flickering, erratic light of a sputtering torch held by <Sir Aldren> (positioned slightly ahead on the left). The stone walls are visibly dripping, covered in dark, clinging moss. The camera is low, emphasizing the desperate downward movement. <Queen Lyara> is centered, clutching <Elara (Infant)> tightly to her chest, her eyes wide with fear but set with resolve. The lighting casts deep chiaroscuro shadows on the wet rock, highlighting every pore and streak of grime on <Queen Lyara>'s face. Shallow depth of field blurs the immediate foreground stone.",
    "variation_type": "small",
    "variation_reason": "This shot primarily involves constant tracking movement of the camera and the three characters' continuous movement through the tunnel, maintaining the same spatial relationship and visual details, fitting the criteria for a small variation.",
    "ff_desc": "A photorealistic medieval fantasy, HBO prestige television quality, tight tracking shot, low angle, focusing on the claustrophobic UNDER CASTLE TUNNELS at night. The stone walls are wet, dripping, and covered in dark, clinging moss. Illumination comes from the flickering, erratic light of a torch held to the left and slightly ahead. The central figure, the woman with olive skin and amber eyes, is centered, clutching a swaddled infant tightly to her chest, her eyes wide with fear but set with resolve. Shallow depth of field strongly blurs the immediate foreground wet stone. The torchlight carves deep chiaroscuro shadows onto the wet rock and the central figure's face.",
    "ff_vis_char_idxs": [
        1,
        3,
        4
    ],
    "lf_desc": "A photorealistic medieval fantasy, HBO prestige television quality, tight tracking shot, low angle, focusing on the claustrophobic UNDER CASTLE TUNNELS at night. The stone walls are wet, dripping, and covered in dark, clinging moss. Illumination comes from the flickering, erratic light of a sputtering torch held slightly ahead and to the left. The central figure, the woman with olive skin and amber eyes, is centered, clutching the swaddled infant tightly to her chest, still wide-eyed with resolve. The scarred Knight is now slightly further ahead on the left. Shallow depth of field strongly blurs the immediate foreground wet stone. The torchlight continues to cast deep chiaroscuro shadows on the wet rock, emphasizing the grime on the woman's face.",
    "lf_vis_char_idxs": [
        1,
        3,
        4
    ],
    "motion_desc": "The camera executes a tight tracking shot, maintaining a low angle, traveling forward and slightly downward, keeping pace just behind the scarred Knight who is slightly ahead and to the left, holding the sputtering torch. The camera is motivated by the desperate urgency of their passage through the tunnel. The woman with olive skin and amber eyes, positioned centrally, moves forward, closely following the Knight while securely holding the swaddled infant against her chest. The light source (the torch) moves with the Knight, causing the flickering illumination and the resulting deep shadows cast on the tunnel walls and the central figure's face to shift erratically throughout the movement. Ambient sound consists primarily of dripping water and the slight scrape of their footwear on the uneven stone floor. There is no palpable musical score, reflecting the immediate danger and claustrophobia.",
    "audio_desc": "[Sound Effect] Constant, irregular dripping of water echoes in the confined space. Heavy, ragged breathing from <Sir Aldren> and <Queen Lyara>. The faint, stifled whimpers of <Elara (Infant)> are audible but muffled by the swaddling. In the far distance, very muffled shouts and the metallic clash of fighting briefly intrude, then fade. [Audio Score] Low, tense drone, heartbeat-like pulse."
}