[
    "SCENE 1: THE CONSPIRACY - FOREST PATH - DUSK\n\nSHOT 1: ESTABLISHING. EXTREME WIDE AERIAL SHOT. The camera slowly drifts over the dark, dense forest canopy at dusk. God rays pierce patches of thick, low-hanging fog. The camera cranes down through the mist, revealing the oppressive scale of the woods, before executing a slow pan across the mossy, cluttered forest floor, finding the narrow path that vanishes into deep shadow. NO CHARACTERS. The sound is the WHISPER of wind through the high canopy, punctuated by the distant, echoing CALLS OF CROWS. A low, ambient DRONE begins in the musical score.\n\nSHOT 2: EXTREME CLOSE-UP. The Fox's black-gloved hand presses a small, corked glass vial containing the dark sleeping draught firmly into Red's bare, porcelain palm. The contrast between leather and skin is stark. The camera remains absolutely static, emphasizing the secretive tension. Sound is the muffled forest ambience, the distant crows carrying over the score.\n\nSHOT 3: TWO-SHOT. Intimate framing, low angle. Red and The Fox face each other, their breaths misting between them as thin fog curls around their ankles. A slow DOLLY PUSHES forward, emphasizing the fraction of an inch separating their lips. Red’s green-hazel eyes burn with desperate longing; The Fox’s amber eyes are razor-sharp. The Fox whispers, his voice a low, breathy rasp: \"Ten beats of the clock. No hesitation.\" Sound is heavy, synchronized breathing and the WHISPER of wind through the high canopy.\n\nSHOT 4: MEDIUM SHOT. Their kiss is brief, fierce, and final—a promise sealed by fate. The camera holds steady on the intensity, capturing the mixture of passion and dread etched on their faces. A single, sharp BIRD CALL cuts the moment, followed by profound INSTANTANEOUS SILENCE.\n\nSHOT 5: WIDE SHOT. The Fox melts away, his dark coat billowing like shadow as he recedes into the deepening fog. Red stands utterly alone on the narrow path beneath the towering oaks. She deliberately pulls the deep crimson hood up over her beautiful hair, squaring her shoulders. A slow CRANE MOVE captures the vast, oppressive scale of the dark forest surrounding her, swallowing her resolve. Sound is the rising swell of a low, mournful CELLO DRONE in the score.\n\nSCENE 2: GRANNY'S CRUELTY - COTTAGE EXTERIOR & FLASHBACK - DAY/NIGHT\n\nSHOT 1: ESTABLISHING. The cottage exterior at golden hour. The camera begins WIDE from the edge of the forest treeline, looking toward the isolated structure. It executes a slow LATERAL TRACKING SHOT along the overgrown garden, revealing dead roses and ivy-covered walls. The crooked chimney trails a thin plume of smoke against the darkening sky. A single, dim lantern illuminates the oak door. NO CHARACTERS. Emotion: lonely menace. Sound: low wind, a single CREAK of the front door, the FAINT CRACKLE of fire inside. The score features sparse, melancholic PIANO NOTES.\n\nSHOT 2: CLOSE-UP FLASHBACK. Young Red, perhaps eight, sits rigid on the stone floor, her face intensely lit by the flickering orange GLOW of the fireplace. Granny's massive, severe shadow engulfs her from behind. The camera is static, focusing tightly on the tension in the child’s jaw. Emotion: pure, internalized fear. Sound: the loud, rhythmic TICKING OF THE GRANDFATHER CLOCK, overlaid by Granny's cold, sharp voice heard faintly OFF-SCREEN: \"Sentiment is weakness.\"\n\nSHOT 3: MEDIUM SHOT FLASHBACK. Granny, gaunt and imposing in a dark dress, SLAMS a heavy leather-bound book shut onto a dark wood table. Young Red’s lower lip visibly trembles, but her eyes visibly harden, locking down any outward display of tears. The camera executes a slight, invasive PUSH-IN focused tightly on the sudden, steely transformation in Red’s eyes. Emotion: the birth of deep-seated hatred. Sound: the CRACK of the book slamming echoes fiercely, overriding all else, before dropping into silence.\n\nSHOT 4: MATCH CUT TO PRESENT. Adult Red’s eyes, displaying that exact same, terrible hardness, track forward. She walks the forest path, hood drawn low, her wicker basket swinging rhythmically. It is a slow, deliberate TRACKING SHOT accompanying her, passing through the dappled light filtering through the canopy. The score transitions abruptly from sparse piano to tense, RISING STRINGS.\n\nSHOT 5: CLOSE-UP, ground level. Red’s worn leather boot steps precisely and deliberately over a thick, gnarled root crossing the path. Focus is entirely on this footfall—a symbolic crossing of a final threshold. All music and ambient sound immediately DROP OUT, replaced by the sharp, solitary THUD of a single, heavy HEARTBEAT, followed by absolute silence.\n\nSCENE 3: THE CRIME - COTTAGE EXTERIOR BACK + INTERIOR - NIGHT\n\nSHOT 1: ESTABLISHING. Night. The cottage is seen from behind, highlighting the small, unlatched back window from which a faint firelight glows. The camera starts WIDE from the dark tree line, then executes a slow DOLLY FORWARD through the overgrown back garden, close to the window. Fog drifts across the stone foundation. The chimney smoke is a phantom plume against the ink-black sky. NO CHARACTERS. Emotion: approaching danger. Sound: CRICKETS, a single distant OWL HOOT, and the FAINT, rhythmic CREAK of the rocking chair from inside. The score features barely audible, high-tension STRINGS.\n\nSHOT 2: MEDIUM SHOT INTERIOR. The Fox, dressed entirely in black, forces the iron latch of the back window with practiced ease. He slips between the shadows like liquid mercury, entering the room. In the foreground, Granny’s rocking chair continues its slow, monotonous CREAK by the dying embers. The camera uses slight HANDHELD movement to convey predatory stealth. Sound: metallic SCRAPE of the latch, the chair’s creak, and the soft POP of wood in the dying fire.\n\nSHOT 3: CLOSE-UP on Granny’s face, half-lit by the embers. Her ice-blue eyes snap WIDE OPEN—not in panic, but in sharp, cold recognition as The Fox’s deep shadow falls over her. The camera remains unnervingly static. The rocking stops INSTANTLY. An absolute, suffocating SILENCE descends upon the room, broken only by the dying FIRE. Sound: Dead silence.\n\nSHOT 4: FRONT DOOR POV FROM INSIDE. Three soft, polite KNOCKS echo against the heavy oak: *tap… tap… tap.* Red’s voice curls through the wood, like spun honey: \"Granny? I brought your linens.\" The heavy door opens, revealing Red framed in the weak exterior light, her face a perfect, porcelain mask of innocent filial concern. The camera is static, treating the entry as high theater. Sound: knocks echo, followed by the low RUMBLE of the distant house settling.\n\nSHOT 5: OVER-THE-SHOULDER SHOT from just behind Granny’s empty rocking chair. The Fox is visible standing statue-still to one side, a dark sentinel. Red steps fully into the room from the other side. Their eyes meet across the dark interior, locking over the rigid, still figure sitting between them—a silent moment confirming their pact is sealed. The camera executes a slow RACK FOCUS, passing from Red’s fleeting look of relief to The Fox’s approving, unwavering gaze. The grandfather clock begins its steady, ominous *TICK-TOCK* once more.\n\nSCENE 4: THE COVER - COTTAGE EXTERIOR RAIN + INTERIOR - NIGHT\n\nSHOT 1: ESTABLISHING. The cottage exterior in a sudden, heavy downpour, seen from a very LOW ANGLE across the now-muddy path. Rain hammers the thatched roof in sheets. A flash of LIGHTNING briefly illuminates the stone walls and the sodden, dead garden. The camera executes a slow PAN from the ruined front door across the storm-lashed facade to the dark treeline. NO CHARACTERS. Emotion: storm as metaphor for consequence. Sound: RAIN ROARING, distant THUNDER, high wind. Score: deep, continuous OMINOUS RUMBLE.\n\nSHOT 2: ACTION SHOT INTERIOR. The heavy oak door splinters VIOLENTLY inward. The Woodsman fills the frame, axe raised high, his plaid shirt dark with rain, his earnest face etched with fierce purpose. Camera is LOW ANGLE looking up at his imposing silhouette against the storm. Emotion: righteous urgency. Sound: massive CRACK of wood breaking, the RAIN roaring, and the Woodsman's heavy, earnest BREATHING.\n\nSHOT 3: MEDIUM SHOT. Red launches herself forward, collapsing over the shrouded, body-sized bundle in the rocking chair, her velvet cloak instantly soaking wet. She points a trembling, lace-cuffed hand toward the broken back window, her voice ragged with expertly manufactured despair: \"A beast! It fled into the pines!\" The camera settles at Red’s eye level, emphasizing the raw, theatrical anguish of her performance. Sound: Red’s choked SOBBING mixing with the rain.\n\nSHOT 4: TWO-SHOT. The Woodsman nods gravely, his honest face grim. He gently lifts the blanket-wrapped shape. He casts a single, respectful, warm glance toward Red as he turns and shouldering his way back out the ruined door into the deluge. Camera follows his heavy movement to the threshold. Emotion: solemn duty. Sound: The roar of the RAIN seems to engulf everything as he steps out.\n\nSHOT 5: SILHOUETTE SHOT captured from a dark, dry vantage point behind the cottage window glass. Red and The Fox stand side-by-side, their outlines sharp against the interior gloom, watching the Woodsman’s broad silhouette shrink against the backdrop of the dark, rain-swept forest. As his shape vanishes, Red subtly allows the mask to slip; a small, triumphant SMILE touches her lips for the first time. Camera remains locked on this moment of victory. Emotion: triumph achieved. Sound: Rain sounds SOFTEN, and the score briefly SWELLS with soaring, hopeful STRINGS.\n\nSCENE 5: THE TWIST - COTTAGE INTERIOR - SILENCE\n\nSHOT 1: ESTABLISHING. SLOW PAN across the empty cottage interior. The camera drifts slowly across the foreground, lingering on the dying embers in the fireplace, the motionless grandfather clock, the heavy burgundy curtain hanging still, and the empty rocking chair. It moves like a ghost through the charged air. NO CHARACTERS. Emotion: eerie stillness, a sense of something profoundly wrong. Sound: ONLY the relentless, metronomic TICKING of the grandfather clock. No score. Absolute silence between the ticks.\n\nSHOT 2: CLOSE-UP. Red stands alone in the dim foyer. Her crimson hood is down, and her hair cascades freely. For the first time, her face is relaxed, almost radiant with genuine relief. She reaches one slender, free hand toward the heavy iron door handle. Camera executes a slow, intimate DOLLY IN on her expression of burgeoning freedom and finality. Emotion: freedom at last. Sound: absolute, heavy silence surrounding her actions.\n\nSHOT 3: MEDIUM SHOT. Her fingers grip the handle, and she pulls the massive door shut. A deep, resonant THUD reverberates through the stone structure, signaling absolute closure. She turns into the room, breathing out a silent sigh of success. Camera holds steady, waiting with her for the aftermath of her triumph. Emotion: closure. Sound: The THUD reverberates once, then fades into nothingness.\n\nSHOT 4: WIDE SHOT of the cluttered cottage interior. Following the silence, a secondary SHADOW detaches itself from the deepest shadows near the heavy, dark burgundy bedroom curtain. Granny steps out smoothly from behind the fabric—her silver hair immaculate, her black Victorian dress perfect, untouched by the staged attack. A thin, cruel, triumphant SMILE stretches her lips. Camera begins a slow, creeping DOLLY TOWARD her figure, building immense, mounting dread. Sound: A single, excruciatingly high, sustained VIOLIN NOTE begins to KEEN. Granny whispers, her breath barely moving the air: \"Did you really think I wouldn't know, dear?\"\n\nSHOT 5: EXTREME CLOSE-UP on Red's face. In one horrifying instant, every flicker of hope, triumph, and memory of the Fox is violently scoured away. Her porcelain skin blanches, her beautiful hazel eyes widen into perfect circles of paralyzing, utterly silent HORROR. Her lips part mid-breath, unable to form a scream. The camera holds, unblinking, refusing to look away. Emotion: devastation, utter defeat. Sound: The high violin note CUTS OUT, replaced by one final, deep, resonant BASS NOTE that seems to vibrate in the structural silence. SLOW FADE TO BLACK.\n"
]