[
    {
        "idx": 0,
        "is_last": false,
        "cam_idx": 0,
        "visual_desc": "BLACK SCREEN. A stark, grainy texture overlaid, suggesting old film stock. No visible elements.",
        "audio_desc": "[Narrator] (deep, aged male voice, like a historian telling a legend): \"It came without warning. On the night of the harvest feast, when every sword was sheathed and every guard was drunk on wine.\""
    },
    {
        "idx": 1,
        "is_last": false,
        "cam_idx": 1,
        "visual_desc": "FADE IN to an EXTREME CLOSE UP on the polished, cold steel of a dagger being slowly drawn from its sheath. The lighting is harsh side-light, emphasizing the dark, reflective surface of the blade casting sharp, deep shadows (chiaroscuro). The surrounding leather of the sheath is visibly worn. This shot has a very shallow depth of field, focusing only on the sliding steel. The environment suggests darkness and intimacy.",
        "audio_desc": "[Sound Effect] The RIIIP of steel sliding against leather, amplified unnervingly loud against total silence. Followed by absolute silence. [Score] None."
    },
    {
        "idx": 2,
        "is_last": false,
        "cam_idx": 2,
        "visual_desc": "WIDE SHOT of the THRONE ROOM — NIGHT. The lighting is thrown into sudden chaos, flickering shadows mixing with the warm residual light of the feast, now tainted by urgency. Shadowy ASSASSINS, dressed in deep black practical garb, surge from the corners and recesses of the frame. Furniture lies overturned in the foreground, their wood texture rough and damaged. TAPESTRIES are violently slashed mid-frame. <KING EDRAN> (weathered face, armor catching the chaotic light) leaps up from the throne on the left side of the frame, drawing his heavy sword with practiced speed. He is facing center-right where the assassins are densest.  <KING EDRAN> (roaring above the din) says: \"To arms! Protect the Queen!\" The shot is handheld, vibrating slightly to convey kinetic violence.",
        "audio_desc": "[Sound Effect] A sudden eruption of screams, the sickening clang of steel meeting steel, and the heavy crash of overturned furniture. [Score] A sudden, jarring orchestral stab, quickly dissolving into chaotic percussion."
    },
    {
        "idx": 3,
        "is_last": false,
        "cam_idx": 3,
        "visual_desc": "CLOSE UP on <KING EDRAN>'s face (deep brown eyes wide with effort and shock). His practical armor is suddenly disrupted as dark, matte steel from behind pierces his back, reflecting zero light. A visible trickle of dark, tacky fluid stains the silver threading on his gorget. His body language shows immediate structural failure, collapsing onto his knees. His gaze locks desperately across the frame toward the right, where <QUEEN LYARA> is partially visible in the background carnage. <KING EDRAN> (his dying breath, barely a whisper) says: \"Take our daughter. Go. Live.\"",
        "audio_desc": "[Sound Effect] A wet, muffled impact sound. The chaotic external battle fades instantly, muffled by physical proximity to the sound source. [Score] A single, devastatingly sad, sustained CELLO note enters and holds."
    },
    {
        "idx": 4,
        "is_last": false,
        "cam_idx": 4,
        "visual_desc": "CAMERA RACK FOCUS starts on the last bead of sweat on <KING EDRAN>'s dying eye (which is now blurred) and shifts sharply to a CLOSE UP on <QUEEN LYARA>'s face. Her olive skin is starkly lit by firelight catching the terror. Her naturally resilient appearance is shattered; her amber eyes are wide with raw horror and her mouth is pulled into a silent scream shape, lips drawn tight. <QUEEN LYARA> (screaming) says: \"EDRAN!\"",
        "audio_desc": "[Sound Effect] The muffled battle sounds are distant now, just a low roar. [Score] The single cello note swells briefly, profoundly sad."
    },
    {
        "idx": 5,
        "is_last": false,
        "cam_idx": 5,
        "visual_desc": "MEDIUM SHOT at eye level capturing <SIR ALDREN> and <QUEEN LYARA> near a shadowed wall archway on the lower left. <SIR ALDREN> (scarred, gruff, armor now marred) slams powerfully into <QUEEN LYARA>, effectively pinning her against the stone wall as he yanks her upright. <QUEEN LYARA> is clutching the swaddled <INFANT PRINCESS ELARA> tightly to her chest with one arm, her other hand reaching desperately back toward the unseen center of the room. <SIR ALDREN> (gruff, anguished whisper) says: \"We cannot, Your Grace! The passage now!\" <QUEEN LYARA> (thrashing, reaching back desperately) says: \"My son! Cael is still in his crib!\"",
        "audio_desc": "[Sound Effect] Grunts of exertion, the rough texture of <ALDREN>'s armor scraping against <LYARA>'s garment. The distant cries of battle resume slightly louder. [Score] Minor key strings begin to creep back in."
    },
    {
        "idx": 6,
        "is_last": false,
        "cam_idx": 6,
        "visual_desc": "CLOSE UP on <QUEEN LYARA>'s face, captured mid-turn. Her expression is one of complete, agonizing defeat. Her amber eyes brim with tears, and her jaw muscles visibly clench as she forces herself to yield. She stops thrashing, her posture collapsing as <SIR ALDREN>'s grip pulls her sideways toward the hidden archway. <SIR ALDREN> (gruff, anguished) says: \"If we go back, we all die! Your daughter needs her mother alive!\" She is half-pulled through the narrow stone opening, the rough texture of ancient stone framing the edges of the shot.",
        "audio_desc": "[Sound Effect] A faint, heartbroken whimper from <QUEEN LYARA> as she yields. The sound of the baby queen whimpering softly, barely audible over <LYARA>'s ragged breath. [Score] A low, throbbing string rhythm begins."
    },
    {
        "idx": 7,
        "is_last": false,
        "cam_idx": 7,
        "visual_desc": "SLOW MOTION SEQUENCE. The massive throne room doors, made of dark, thick wood banded with iron, burst inward violently, sending splinters flying across the wide perspective. <MORGATH> enters the frame from the center, perfectly composed. Her fitted black gown flows dramatically, and her long, straight raven hair streams behind her as if she’s underwater. The lighting is cold, blue-grey moonlight mixing with dying torch fire, creating very sharp contrast. She walks with unnerving, predatory grace past the shapes of fallen guards, utterly untouched by the carnage. The camera position is LOW-ANGLE, looking up at her, emphasizing her height and imposing silhouette against the background of destruction. She stops near the ornate, gilded crib positioned slightly to the right. <MORGATH> (silky, soft, almost musical) says: \"Shhh. Shhh. Your father's crown is mine now, little prince. But you... you I will keep.\"",
        "audio_desc": "[Sound Effect] Massive sound of wood splintering and tearing. All chaotic background sound is suppressed by the score transition. [Score] The dark, seductive cello motif plays its signature riff, cutting sharply through any other ambient noise."
    },
    {
        "idx": 8,
        "is_last": true,
        "cam_idx": 8,
        "visual_desc": "EXTREME CLOSE UP on <MORGATH>'s face. Her pale, porcelain skin contrasts sharply with the shadow cast by her high collar. Her large, nearly-black eyes are focused downward with an unsettling, calculated stillness. Her full crimson lips curve into a slow, predatory smile—the first true expression seen on her face, but it holds no warmth. She gently scoops up <INFANT PRINCE CAEL> who is wailing just out of frame at first, but now his tiny fist enters the foreground, clenched. The shot is tight enough to see the subtle texture of her skin and the reflection of candlewax in her dark eyes.",
        "audio_desc": "[Sound Effect] The wailing of <INFANT PRINCE CAEL> is abruptly muffled as he is lifted. [Score] Morgath's dark, seductive cello motif swells slightly, dominating the soundscape for the final moment."
    }
]