[
    "SCENE 1\n\nCHAPTER ONE: THE SEVEN KINGDOMS\n\nEXT. THRONE ROOM - DAY (18 YEARS AGO)\n\nCLOSE UP - AGED PARCHMENT MAP\nThe parchment map, detailed with ink and gold leaf, fills the frame, showing seven distinct regions of a continent. The camera slowly PANS across the land.\n\nNARRATOR (V.O.)\n(Deep, aged male voice)\nThere were seven kingdoms, each proud, each ancient. And for a generation, one man held them together — not by conquest, but by trust. His name was Edran. And this is the story of how his world was taken from him.\n\nSOUND: Subtle, grand orchestral theme begins to build.\n\nMATCH DISSOLVE to:\n\nTHRONE ROOM - DAY\n\nThe texture of parchment melts into the pale stone of the Throne Room. KING EDRAN sits on the imposing throne, the silver-threaded Crown of Sevens upon his head. QUEEN LYARA, visibly pregnant, stands beside him. Warm firelight casts shifting shadows.\n\nEDRAN\n(Deep, resonant baritone, satisfied)\nSeven banners hang in this hall. Seven kingdoms at peace. Let us drink to another year of it.\n\nCOURTIERS\n(Cheering)\nTo King Edran!\n\nLYARA\n(Warm contralto, placing a hand on her belly)\nThe children will know a world without war, my love.\n\nEDRAN\n(Smiling warmly)\nThat is all I ever wanted.\n\nWIDE SHOT - THRONE ROOM\n\nThe hall is full of light, banners drooping slightly, radiating stability. The score swells warmly, but a subtle, dissonant undertone creeps into the harmony. The camera lingers near the edge of the frame, spotlighting a deep SHADOW where a figure is barely visible watching the proceedings.\n\nSOUND: Score shifts subtly to a minor key, unsettling.\n\nFADE TO BLACK.",
    "SCENE 2\n\nCHAPTER TWO: THE NIGHT OF KNIVES\n\nBLACK SCREEN.\n\nNARRATOR (V.O.)\nIt came without warning. On the night of the harvest feast, when every sword was sheathed and every guard was drunk on wine.\n\nFADE IN on:\n\nTHRONE ROOM - NIGHT\n\nCLOSE UP - DAGGER\nExtreme close-up on the polished steel of a dagger being slowly drawn from its sheath. The sound of the steel sliding is unnervingly loud against total silence.\n\nSOUND: RIIIP of steel, followed by absolute silence.\n\nWIDE SHOT - THRONE ROOM\n\nThe hall ERUPTS. Shadowy ASSASSINS in black surge from the recesses. Furniture overturns. TAPESTRIES are slashed in the sudden chaos. KING EDRAN leaps up, drawing his sword with practiced speed.\n\nEDRAN\n(Roaring above the din)\nTo arms! Protect the Queen!\n\n(He expertly cuts down one assassin, but two more immediately replace him. The camera is handheld, capturing the kinetic violence.)\n\nSOUND: Sickening clang of steel, screams, crashing furniture.\n\nCLOSE UP - KING EDRAN\nEran is violently stabbed from behind. Dark steel pierces his practical armor. He collapses onto his knees, his strength visibly draining. His eyes lock across the carnage onto Lyara.\n\nEDRAN\n(His dying breath, barely a whisper)\nTake our daughter. Go. Live.\n\nSOUND: The chaotic external battle muffles instantly, replaced by a single, devastatingly sad CELLO note.\n\nCAMERA RACK FOCUS from Edran’s dying gaze to QUEEN LYARA’S face, frozen in horror.\n\nLYARA\n(Screaming)\nEDRAN!\n\nMEDIUM SHOT - ALDREN AND LYARA\nSIR ALDREN, a grizzled Knight, slams into Lyara, yanking her up just as she tries to move. She tightly clutches the swaddled INFANT PRINCESS ELARA.\n\nALDREN\n(Gruff, anguished whisper)\nWe cannot, Your Grace! The passage now!\n\nLYARA\n(Thrashing, reaching back desperately)\nMy son! Cael is still in his crib!\n\nALDREN\nIf we go back, we all die! Your daughter needs her mother alive!\n\nAldren hauls her toward a disguised stone archway. Lyara’s face breaks in defeat as she is pulled through the hidden entrance.\n\nSLOW MOTION - MORGATH'S ENTRANCE\n\nThe massive throne room doors burst inward. MORGATH enters, perfectly composed, her black gown flowing, her raven hair streaming. She walks with unnerving grace past the dying guards, utterly untouched. The camera is low-angle, emphasizing her terrifying beauty. She approaches the gilded crib where the INFANT PRINCE CAEL is wailing.\n\nMORGATH\n(Silky, soft, almost tender)\nShhh. Shhh. Your father's crown is mine now, little prince. But you... you I will keep.\n\nMorgath smiles—a slow, predatory expression. She gently scoops up the baby.\n\nSOUND: Her dark, seductive cello motif cuts in sharply as the score cuts out.\n\nFADE TO BLACK.",
    "SCENE 3\n\nCHAPTER THREE: THE TUNNEL\n\nBLACK SCREEN.\n\nNARRATOR (V.O.)\nThe Queen fled through the veins of the old castle — passages built a thousand years ago for this very purpose. She carried her daughter, and left her son behind. It was the choice that would haunt her for eighteen years.\n\nFADE IN on:\n\nUNDER CASTLE TUNNELS - NIGHT\n\nClaustrophobic darkness. Erratic TORCHLIGHT illuminates dripping, mossy stone walls. The camera TRACKS closely behind LYARA, ALDREN, and the infant ELARA, emphasizing their sheer desperation.\n\nSOUND: Dripping water, heavy, ragged breathing, the baby’s stifled whimpers, distant, muffled sounds of fighting.\n\nCLOSE UP - LYARA\nLyara’s face is streaked with grime and tears, illuminated by the sputtering torch. Her eyes are diamond-hard with resolve.\n\nLYARA\n(Whispering fiercely to the infant)\nI will come back for him. I swear it. On your father's name, I swear it.\n\nCAMERA holds on her determined expression.\n\nWIDE SHOT - FOREST EDGE - DAWN\n\nThey burst from a low, hidden stone archway onto a forest floor blanketed in thick, cold mist. High on the ridge, the castle burns against the lightening sky.\n\nALDREN\n(Kneeling, gruff, looking only at the path ahead)\nYour Grace, the Witch will search every road and every village. We must become no one. The girl must never know who she is — not until she's ready.\n\nLYARA\n(Looking at the sleeping infant, then at the burning keep, a heavy nod)\nShe will know. When the time comes, she will know everything.\n\nAldren stands, positioning himself between the Queen/Child and the castle. They turn and walk away from the camera, disappearing into the dense white mist.\n\nSOUND: Birdsong mixes with the faint crackle of the distant fire. Lonely strings score begins.\n\nNARRATOR (V.O.)\nAnd so the Queen of Seven Kingdoms became a peasant woman with no name, raising a princess who thought she was nobody.\n\nFADE TO BLACK.",
    "SCENE 4\n\nCHAPTER FOUR: THE WITCH'S PATIENCE\n\nBLACK SCREEN.\n\nNARRATOR (V.O.)\nMorgath took the throne. She took the crown. And she took the boy. Not out of mercy — out of hunger. For Morgath had read the old texts, and she knew what the prince's blood could buy her.\n\nFADE IN on:\n\nTHRONE ROOM - WIDE SHOT - 18 YEARS LATER\n\nThe hall is fundamentally changed. Black drapes smother the natural light. Hundreds of black candles cast an eerie glow. The royal banners are replaced by Morgath’s crimson threads. MORGATH sits upon the throne, wearing a heavy crown of black iron thorns. Beside the throne, the infant PRINCE CAEL sleeps peacefully in his gilded crib.\n\nSOUND: Only the faint flicker and crackle of candles in the oppressive silence.\n\nCamera executes a slow, deliberate DOLLY toward her.\n\nCLOSE UP - MORGATH AND BOOK\nMorgath consults an enormous, archaic book opened on a pedestal. The script on the pages glows with a sickly, internal green light that catches her dark eyes.\n\nMORGATH\n(Soft, deliberate, each word savored)\nThe thousand-year moon. It rises when he turns eighteen. One ritual. One sacrifice. Royal blood, freely given or taken by force. And I will have power that no mortal has held since the world was young.\n\nSOUND: A low, mechanical HUM emanates from the glowing book.\n\nMEDIUM SHOT - MORGATH AND CAEL\nMorgath leans down over the crib. She ignores the throne, her focus entirely on the sleeping boy.\n\nMORGATH\n(Almost a lullaby whisper)\nI will feed you. I will teach you. I will make you love me, little prince. And when the moon rises... you will give me everything.\n\nCael gurgles contentedly in his sleep under her touch. Morgath’s lips curl into a horrifying, possessive facsimile of tenderness.\n\nSOUND: Cael's soft sounds. Morgath's cello theme twists into a dark lullaby.\n\nHOLD SHOT.",
    "SCENE 5\n\nCHAPTER FIVE: THE GIRL WHO DIDN'T KNOW\n\nBLACK SCREEN.\n\nTEXT ON SCREEN: \"18 YEARS LATER.\"\n\nNARRATOR (V.O.)\nThe Queen kept her word. She hid among common folk, in a village so small it had no name. And she raised her daughter as a farmer's child — strong, stubborn, and completely unaware of the blood that ran in her veins.\n\nFADE IN on:\n\nPEASANT VILLAGE - MORNING\n\nESTABLISHING SHOT of a humble village waking up in morning mist. Thatched roofs, muddy lanes, domestic animals moving.\n\nSOUND: Roosters crowing, distant sheep bleating, very pastoral.\n\nMEDIUM SHOT - ELARA WORKING\nELARA (18), unrecognizable as royalty, wears rough-spun brown attire. Her dark auburn hair is wild. She laughs while hauling a heavy wooden yoke alongside two older villagers. She is physically strong.\n\nELARA\n(Bright, fast, unpolished vernacular)\nIf old Harren charges me double for flour again, I swear I'll dump it in his well.\n\nFRIEND\n(Laughing)\nYou wouldn't dare.\n\nELARA\n(Grinning, challenging)\nTry me.\n\nCLOSE UP - MOMENT OF ANGER\nAs Elara laughs, a rough VILLAGER bumps her hard, knocking the yoke and spilling a basket of grain into the mud.\n\nVILLAGER\n(Sneering)\nWatch where you're going, orphan girl.\n\nElara’s expression snaps from joy to white-hot anger. The air around her violently SHIMMERS. A dry, aged WOODEN FENCE POST beside them CRACKS audibly. Nearby fallen leaves SUDDENLY float UPWARD and spin briefly.\n\nElara gasps, staring down at her calloused hands, terrified.\n\nELARA\n(Whispering, horrified)\nWhat... what did I just do?\n\nSOUND: All village bustle cuts out instantly. A distinct, low, resonant GOLDEN HUM begins.\n\nHOLD SHOT on her stunned face.",
    "SCENE 6\n\nCHAPTER SIX: THE TRUTH\n\nBLACK SCREEN.\n\nNARRATOR (V.O.)\nThe Queen had waited eighteen years for this moment. She had prayed it would never come. And she had prayed it would.\n\nFADE IN on:\n\nFOREST CLEARING - DAY\n\nESTABLISHING SHOT of a secluded clearing. Dappled sunlight filters through the canopy onto mossy stones and a chattering stream. QUEEN LYARA (late 50s, appearance weathered, wearing dark, practical peasant garb) stands waiting for ELARA. The camera sets a calm, wide frame.\n\nSOUND: Gentle stream noise, birdsong.\n\nMEDIUM SHOT - THE CONFESSION\nLyara turns to face Elara. Her voice is steady but laced with suppressed pain.\n\nLYARA\nYour name is not Elara the farmer's daughter. Your name is Elara, firstborn of King Edran, heir to the Seven Kingdoms. Your father was murdered. Your brother was taken. And the woman who sits on your father's throne... she is not a queen. She is a witch who has waited eighteen years to sacrifice your brother's blood for power that will make her immortal.\n\n(Camera performs a slow, tight PUSH-IN on Elara’s face as she cycles through shock, denial, and burgeoning fury.)\n\nELARA\n(Barely audible)\nYou're lying.\n\nLYARA\nLook at your hands, Elara. You have your father's gift. The blood of kings. It was always in you.\n\nSOUND: Cinematic string score swells, aching and building.\n\nCLOSE UP - ELARA'S POWER\nElara slowly raises one hand toward the stream bed. A warm, vibrant GOLDEN LIGHT pours from her fingertips. The water in the stream VISIBLY slows, hesitates, and then VIOLENTLY reverses its flow against gravity. Mossy stones lift silently into the air.\n\nElara’s amber eyes glow intensely, fully alight with raw power. The golden HUM from the previous scene returns, soaring now.\n\nELARA\n(Voice trembling with wonder and fury)\nHow long? How long have you known what I am?\n\nLYARA\n(Tears streaming, chin trembling)\nSince the night I carried you through the dark. Since the night I left your brother behind.\n\nTWO SHOT - RESOLVE\nElara lowers her hand, the power receding slightly, but her gaze is fixed, luminous. She looks instantly regal, the carefree peasant gone, replaced by a steel spine.\n\nELARA\n(Her unpolished voice now carrying undeniable, inherited authority)\nWhere is my brother?\n\nLYARA\n(Whispering, defeated)\nThe Witch has him. In the castle where your father died.\n\nELARA\n(Jaw locks, her eyes flaring gold again)\nThen I'm going back. And I'm bringing him home.\n\nSOUND: The hero’s bold, determined theme cuts in sharply. SCORE SWELLS.\n\nCUT TO BLACK.",
    "SCENE 7\n\nCHAPTER SEVEN: THE MIRROR\n\nBLACK SCREEN.\n\nNARRATOR (V.O.)\nBut in the castle of the seven kingdoms, the Witch had eyes everywhere. And mirrors that showed more than reflections.\n\nFADE IN on:\n\nTHRONE ROOM/MORGATH'S CHAMBER - NIGHT\n\nMORGATH stands before a massive, ornate MIRROR that seems to drink the light. She is motionless, porcelain-pale, perfectly imposing. She remains in the same pose established eighteen years prior.\n\nSOUND: Silence, broken only by the faintest echo of Morgath's dark cello motif.\n\nCLOSE UP - THE MIRROR\n\nThe dark surface of the mirror ripples violently, disturbing like still water. A shock of vibrant GOLDEN LIGHT appears within the glass. An image forms—the clear, determined face of Elara, her amber eyes blazing.\n\nSOUND: The golden HUM clashes violently with the dark cello motif in the soundtrack.\n\nMORGATH (O.S.)\n(Voice suddenly tight, strained)\nShow me... show me who threatens my crown.\n\nThe camera PUSHES hard into the reflection, blurring the boundary between the physical room and the illusory image, focusing on Elara’s eyes.\n\nEXTREME CLOSE UP - MORGATH'S FACE\n\nFor the very first time, Morgath's composure shatters. Her dark eyes fly wide open in unguarded shock and fear. Her crimson lips part.\n\nMORGATH\n(A deadly whisper, confirmation laced with terror)\nThe King's daughter lives. She has the gift.\n\n(A beat of silence. Her expression instantly hardens into predatory fury.)\n\nFind her. Find her before the moon rises. Kill her before she reaches the boy.\n\nThe ornate mirror SHATTERS violently, sending sharp shards of dark glass exploding outward across the frame. The camera locks onto Morgath’s furious, startled face amidst the falling debris.\n\nSOUND: The violent, loud CRASH of shattering glass, followed by absolute dead silence. One final, ominous BASS NOTE echoes.\n\nHARD CUT TO BLACK.\n\nTITLE CARD: THE SEVEN KINGDOMS\n\nTEXT: \"Chapter One: Blood of the Crown\""
]