{
    "idx": 5,
    "is_last": false,
    "cam_idx": 5,
    "visual_desc": "EXTABLISHING SHOT (SCENE 2). The cottage exterior at golden hour. Photorealistic, rich color grading. The camera starts WIDE from the edge of the dark forest treeline, looking toward the isolated structure. It executes a slow LATERAL TRACKING SHOT along the overgrown garden, revealing dead roses clinging to the stone walls and ivy encroachment. The crooked chimney trails a thin plume of smoke against the darkening sky. A single, dim oil lantern illuminates the weathered oak door. No characters are visible. The entire scene feels tactile and lonely.",
    "variation_type": "medium",
    "variation_reason": "The shot transitions significantly in proximity and precise framing due to the lateral camera movement, shifting the compositional weight from the dark forest edge to the cottage facade, revealing details like the door and garden. While no characters appear or move, the significant camera movement towards the structure and the subtle change in ambient lighting as the golden hour progresses warrants a medium variation.",
    "ff_desc": "A photorealistic dark fairy tale establishing shot, rendered with rich cinematic color grading, taken from the edge of a dark forest treeline. The composition is wide, focusing on an isolated, weathered stone cottage bathed in the warm, oblique light of the golden hour. The crooked chimney faintly trails a thin plume of grey smoke against the darkening sky. No figures are present. The immediate foreground is dominated by the texture of dark, dense forest foliage. The overall mood is tactile and lonely.",
    "ff_vis_char_idxs": [],
    "lf_desc": "A photorealistic dark fairy tale medium wide shot of the isolated stone cottage exterior during the deepening twilight of the golden hour. The camera has tracked laterally, now positioning slightly closer to the front facade. A single, dim oil lantern casts a warm circle of light directly onto the weathered oak door. Dead roses cling to the stone walls, partially obscured by encroaching ivy. The crooked chimney continues to emit a thin plume of smoke against the now almost deep sapphire sky. No figures are visible. The texture of the weathered stone and encroaching vegetation remains highly tactile.",
    "lf_vis_char_idxs": [],
    "motion_desc": "The camera executes a slow lateral tracking shot (or dolly left) from its initial position on the edge of the dark forest, moving parallel to the cottage facade, tracking past the overgrown garden area. This movement brings the camera slightly closer to the house, transitioning from an extreme wide establishing shot to a medium wide shot that emphasizes the detail of the garden and the door area. The illumination subtly shifts as the golden hour light fades, deepening the shadows across the stone walls. No elements within the frame move, maintaining a silent, observational mood with a low cello drone score and the ambient sound of light evening wind.",
    "audio_desc": "[Sound Effect] Low, cold wind through the garden; a single, drawn-out CREAK of the front door; the FAINT, warm CRACKLE of fire audible inside. [Music Score] Sparse, melancholic PIANO NOTES."
}